In [3]:
import pandas as pd
import numpy as np

In [4]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [5]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [6]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [8]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## Working with Dates

In [9]:
# converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [10]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## 1. Extracting Year

In [11]:
date['date_year'] = date['date'].dt.year

In [12]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

## 2. Extracting Month

In [13]:
date['date_month_no'] = date['date'].dt.month

In [14]:
date.sample(5)

          date  product_id  city_id  orders  date_year  date_month_no
875 2018-11-01        4495       28       1       2018             11
746 2019-02-01        6632       22       5       2019              2
464 2018-09-26        4895       29       1       2018              9
309 2019-08-14        4352       16       1       2019              8
0   2019-12-10        5628       25       3       2019             12

In [15]:
# Extracting month name
date['date_month_name'] = date['date'].dt.month_name()

In [16]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
481,2019-02-16,1115,30,1,2019,2,February
586,2019-06-26,2563,18,8,2019,6,June
563,2019-04-11,7294,1,2,2019,4,April
565,2019-04-29,888,20,5,2019,4,April
73,2019-07-28,3913,13,19,2019,7,July

## Extracting day

In [17]:
date['day_no'] = date['date'].dt.day

In [18]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,day_no
527,2019-08-01,2811,13,2,2019,8,August,1
161,2019-03-30,7140,18,26,2019,3,March,30
802,2018-10-23,5361,28,3,2018,10,October,23
353,2018-08-08,2284,9,8,2018,8,August,8
690,2018-12-16,3799,20,3,2018,12,December,16

In [19]:
# extracting dayofweek
date['day_dow'] = date['date'].dt.dayofweek

In [20]:
# dayofweek-name
date['dow_day_name'] = date['date'].dt.day_name()

In [21]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,day_no,day_dow,dow_day_name
746,2019-02-01,6632,22,5,2019,2,February,1,4,Friday
452,2018-11-05,7450,21,4,2018,11,November,5,0,Monday
992,2019-11-01,4146,9,1,2019,11,November,1,4,Friday
952,2018-08-18,6492,16,1,2018,8,August,18,5,Saturday
497,2018-11-26,4667,9,1,2018,11,November,26,0,Monday

In [22]:
date.drop(columns = ['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month_name,day_no,day_dow,dow_day_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [23]:
# is day a weekend?
date['day_is_weekend'] = np.where(date['dow_day_name'].isin(['Sunday', 'Saturday']), 1, 0)

In [24]:
date.head(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,day_no,day_dow,dow_day_name,day_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

In [25]:
# Extract Quarter
date['quarter'] = date['date'].dt.quarter

In [26]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,day_no,day_dow,dow_day_name,day_is_weekend,quarter
75,2019-10-12,289,24,1,2019,10,October,12,5,Saturday,1,4
697,2019-10-10,3582,26,2,2019,10,October,10,3,Thursday,0,4
195,2019-05-01,5470,16,23,2019,5,May,1,2,Wednesday,0,2
964,2018-12-06,6740,13,3,2018,12,December,6,3,Thursday,0,4
247,2019-12-06,7148,16,29,2019,12,December,6,4,Friday,0,4

In [27]:
# Extracting semester
date['Semester'] = np.where(date['quarter'].isin([1, 2]), 1, 2)

In [28]:
date.head(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,day_no,day_dow,dow_day_name,day_is_weekend,quarter,Semester
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1

### Extract Time elapsed between dates

In [29]:
import datetime
today = datetime.datetime.today()

In [30]:
today

datetime.datetime(2025, 7, 10, 12, 29, 57, 121651)

In [31]:
today - date['date']

0     2039 days 12:29:57.121651
1     2521 days 12:29:57.121651
2     2452 days 12:29:57.121651
3     2154 days 12:29:57.121651
4     2377 days 12:29:57.121651
                 ...
995   2467 days 12:29:57.121651
996   2408 days 12:29:57.121651
997   2256 days 12:29:57.121651
998   2321 days 12:29:57.121651
999   2095 days 12:29:57.121651
Name: date, Length: 1000, dtype: timedelta64[ns]

In [32]:
(today - date['date']).dt.days

0      2039
1      2521
2      2452
3      2154
4      2377
       ...
995    2467
996    2408
997    2256
998    2321
999    2095
Name: date, Length: 1000, dtype: int64

In [33]:
np.round((today - date['date']) / np.timedelta64(1, 'm'), 0)

0      2936910.0
1      3630990.0
2      3531630.0
3      3102510.0
4      3423630.0
         ...
995    3553230.0
996    3468270.0
997    3249390.0
998    3342990.0
999    3017550.0
Name: date, Length: 1000, dtype: float64

# Working with Time

In [34]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [35]:
time['date'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1000 entries, 0 to 999
Series name: date
Non-Null Count  Dtype
--------------  -----
1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

In [36]:
time['date'] = pd.to_datetime(time['date'])

In [37]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [38]:
# Extracting hour, min and sec
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [39]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [40]:
time['time'] = time['date'].dt.time
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

### Time Difference

In [41]:
today - time['date']

0     4225 days 11:39:57.121651
1     4089 days 12:49:57.121651
2     4575 days 12:08:57.121651
3     3877 days 11:58:57.121651
4     4274 days 13:18:57.121651
                 ...
995   4864 days 11:39:57.121651
996   4185 days 13:15:57.121651
997   4650 days 12:52:57.121651
998   4766 days 12:55:57.121651
999   4038 days 13:04:57.121651
Name: date, Length: 1000, dtype: timedelta64[ns]

In [42]:
# difference in seconds
(today - time['date']) / np.timedelta64(1, 's')

0      3.650820e+08
1      3.533358e+08
2      3.953237e+08
3      3.350159e+08
4      3.693215e+08
           ...
995    4.202916e+08
996    3.616318e+08
997    4.018064e+08
998    4.118290e+08
999    3.489303e+08
Name: date, Length: 1000, dtype: float64

In [43]:
 # difference in minutes
(today - time['date']) / np.timedelta64(1, 'm')

0      6.084700e+06
1      5.888930e+06
2      6.588729e+06
3      5.583599e+06
4      6.155359e+06
           ...
995    7.004860e+06
996    6.027196e+06
997    6.696773e+06
998    6.863816e+06
999    5.815505e+06
Name: date, Length: 1000, dtype: float64

In [44]:
 # difference in hours
(today - time['date']) / np.timedelta64(1, 'h')

0      101411.665867
1       98148.832534
2      109812.149200
3       93059.982534
4      102589.315867
           ...
995    116747.665867
996    100453.265867
997    111612.882534
998    114396.932534
999     96925.082534
Name: date, Length: 1000, dtype: float64